export const yearlyMentalData = [
  { 
    month: '3月',
    level: 7,
    title: '新プロジェクトへの期待と不安',
    detail: '急に、新規プロジェクトに割り当てられて<b>不安とワクワク</b>で高揚していました。<br><b>0から1や新しいもの</b>は大好きなので、このプロジェクトに割り当ててくれた上司には感謝しかなかった。'
  },
  { 
    month: '4月',
    level: 9,
    title: 'フロントエンド(Next.js)開発への初挑戦',
    detail: '初のフロント開発に苦しんだが、<b>新しい技術</b>と向き合う形で楽しかった。<br>プライベートも沢山使って、Next.jsを勉強したが、<b>新しい技術を追求</b>する日々は充実して楽しかった。'
  },
  { 
    month: '5月',
    level: 9,
    title: 'モノが形になっていくことによる高揚感',
    detail: '<b>フロント～バック、インフラまでを構築</b>し、物が形になり楽しかった。<br>周りの人も、凄まじいスピードに驚き、やりがいがあった。<br>自分が頑張れば頑張るほど、モノがすさまじいスピードで出来ていく瞬間を見てワクワクが止まらなかった。'
  },
  { 
    month: '6月',
    level: 10,
    title: '作ったものが使われることによる成長とずっとやりたかったことの達成',
    detail: '自分で作ったものをユーザーにモニターとして使ってもらったり、もっといいものを作りたいと思うようになった。<br>ユーザーに使ってもらって<b>その場で直すなど</b>、「良いものを作る」ということに対してのモチベーションが高まった。<br>そして、ここでずっとやりたかった<b>デプロイの完全自動化</b>も達成できて、技術としての成長の最高潮に達した。'
  },
  { 
    month: '7月',
    level: 7,
    title: '突然の商用化の発表による不安',
    detail: 'まだまだプロダクトとして成果が出ていないのに、商用化することが決定してしまい不安が爆増した。<br>と同時に、この時はまだ、<b>新しい高ゼミを作るぞ</b>と活き込んだ月でした。'
  },
  { 
    month: '8月',
    level: 9,
    title: 'あらゆるシステムとの連携するシステムを作る貴重な経験、そして、初めてのアメリカ出張',
    detail: '課金システムを作るにあたって、会員サイト基盤の知識が役立って、どういう仕組みにすればいいかというシステムアーキテクトてきなことができて、やりがいを感じていた。そして、社内のシステムの大きさと偉大さを学び、あらゆるシステムとの連携するシステムを作る経験が出来ることにワクワクしていた。<br>そして、初めてのアメリカ出張に行かせていただくことになって、生成AIについて理解を深めるとともに、夢だった海外の人と働くというのが一瞬でも達成できた喜びに包まれた。'
  },
  { 
    month: '9月',
    level: 5,
    title: 'わからないことだらけのPM',
    detail: '初めてのPMであったこともあり、本当に何をすればいいか全くわからなかった。<br>とにかく、がむしゃらに動いて、前には進めていた。ステークホルダーが増え始め、人も増えて、首が回らない時期に入ってきた。<br>若手とのコミュニケーションはまだ研修の講師の経験もあったので簡単だったが、年上の人とのコミュニケーションがとても難しかった。<br>そして、SORA販管というブラックボックスとの戦いも怖く、頼ることが苦手だからこその苦しみが最大化'
  },
  { 
    month: '10月',
    level: 0,
    title: '初めての挫折、仕事を辞めたいという想いの最大化した月',
    detail: '残業時間も最大に達し、作業も終わらず、土日対応が増えた。原因は、「リーダー」ではなく「作業者」という血が抜けなかったことにある。<br>WBSや進捗管理、課題管理が全くうまくいかず、私自身も全く楽しくない時期。<br>その影響もあり、メンバーのモチベーションも下がり士気も下がりつつあった。毎日嫌と思いながら、仕事に向かっていた。<br>この時、初めて上司に挫折を報告し、社会人で初めて<b>もう無理です</b>と言った。'
  },
  { 
    month: '11月',
    level: 2,
    title: '色んな人にもらったアドバイスに向き合う日々',
    detail: '上司にアドバイスされた、「自分で作業をしてはいけない」「人に仕事を振る前提で考える」ということが全くうまくいかずに苦戦。<br>ただ、後半戦はその意味が少しだけ分かってきた。<br>ただ、「嫌われる勇気を持って仕事を振る」という周りのアドバイスがどうしても納得がいかなかった。<br>なので、自分らしいPMって何だろう？っていうのを考え続けた1か月'
  },
  { 
    month: '12月',
    level: 6,
    title: '自分らしいPM像を少し可視化した1か月',
    detail: '人に仕事を振るということに向き合い、少し解決の道が見えてきた。<b>「仕事を振る前提で、相手の不安に向き合い続ける。」</b>というのが自分にあった仕事の振り方だと思った。<br>「仕事を振る = 嫌われる」ではなくて、きっと相手を不安にさせる行為自体がよくないリーダーであることを理解した。'
  },
  { 
    month: '1月',
    level: 8,
    title: '自分らしいPMスタイルの確立',
    detail: '人と向かいう前提で仕事を振りまくることを覚え、自分らしいPMを見つけることができた。<br>特に、自分の苦手な分野を全部やる必要がないことを理解した。自分の限界を理解した瞬間でもある。<br>その結果、苦手な進捗管理やお金の管理は人に任せて自分が得意な調整や仕様決定、技術選定に集中することで、少しずつ仕事が楽しいと思うようになってきた。'
  },
  {
    month: '2月',
    level: 9,
    title: '自分の能力の低さを知る一方で、挑戦に奮いあがっている1か月',
    detail: '2月は、東京でのあるイベントに参加させていただいた。そこでは、英語でAI関連について議論をする場であった。<br>そこでは、「一言」も話せなかった。屈辱だった。3,4日は準備に時間を当てたにもかかわらず、一言も話せなかったのである。<br>そのあとの社長とのラウンドテーブルでも、特に面白いことも言えず、自分の挑戦力が弱まったことを自覚した1か月。<br>そのあとは、とにかく勉強したり、自分を奮い立たせて尖るようにプライベートを使っている。<br>来年度の所属も決まった。めちゃくちゃ、挑戦のための部署である。今はとてもポジティブである。会社で一番AIに詳しくて、色んな人との出会いを大切にしながら、人として飛躍することを覚悟した1か月。来年度は社内外関係なく、もっと自分の顔を売って、会社、社会に貢献できるエンジニアになる。'
  }
]; 